AccumulationRegisters/УниверсальныйРН_ОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>УниверсальныйРН_ОС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ресурс1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ресурс2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ресурс3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Реквизит1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.КолонкиОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реквизит2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.КолонкиОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реквизит3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.КолонкиОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РазрезДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазрезыДанных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Измерение1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлементыОбъектовСистемы</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Измерение2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлементыОбъектовСистемы</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Измерение3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлементыОбъектовСистемы</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Измерение4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлементыОбъектовСистемы</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Измерение5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлементыОбъектовСистемы</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Catalogs/КонстантыИНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>КонстантыИНастройки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСистемы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрезДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазрезыДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолонкаОбъекта</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.КолонкиОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПростойТип</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлементОбъектаСистемы</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлементыОбъектовСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТипыОбъектов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипОбъекта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыОбъектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбъектыСистемы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектСистемы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыСистемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВариантыОбъектов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантОбъекта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыОбъектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РазрезыДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РазрезДанных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазрезыДанных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КолонкиОбъектов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КолонкаОбъекта</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.КолонкиОбъектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПростыеТипы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПростойТип</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭлементыОбъектовСистемы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭлементОбъектаСистемы</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЭлементыОбъектовСистемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/Алгоритмы/Ext/Module.bsl
Процедура Тестовая(ТаблицыОбъекта) Экспорт
	//ТаблицаПерсонал = Справочники.ОбъектыСистемы.ПолучитьСсылку(Новый УникальныйИдентификатор("6660783b-6859-11eb-91ca-bcaec5cbeec1"));
	//ТаблицаПерсонал = Справочники.ОбъектыСистемы.НайтиПоРеквизиту("СистемноеНаименование", "ТаблицаПерсонал");
	ОС_ТаблицаПерсонал = Справочники.КонстантыИНастройки.ТестоваяКонстанта.ОбъектСистемы;
	
	Если Не ЗначениеЗаполнено(ОС_ТаблицаПерсонал) Тогда
		Сообщить("Не выполнена настройка алгоритма");
		
		Возврат;
	КонецЕсли;
	
	Для Каждого ТаблицаОбъекта Из ТаблицыОбъекта Цикл
		Если ТаблицаОбъекта.Ключ = ОС_ТаблицаПерсонал Тогда
		//Если ТаблицаОбъекта.Ключ.СистемноеНаименование = "ТаблицаПерсонал" Тогда
			Для Каждого СтрокаТаблицы Из ТаблицаОбъекта.Значение Цикл
				СтрокаТаблицы.ВидДвижения = СтрокаТаблицы.Количество_ >= 0;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура СобратьПериоды(Алгоритм, ТаблицыОбъекта, ДокументОбъект) Экспорт
	СтрокаПараметров = Алгоритм.ПараметрыАлгоритма.Найти("ГруппаПараметров1", "ИмяГруппыПараметров");
	
	ПериодыДляРазмещения = ДокументОбъект.ДополнительныеСвойства.ТаблицыОбъекта[СтрокаПараметров.Параметр1];
	ТаблицаНовыхДвижений = ДокументОбъект.ДополнительныеСвойства.ТаблицыОбъекта[СтрокаПараметров.Параметр6];
	ТаблицаНовыхДвижений.Очистить();
	
	СтрокаРаботник = ДокументОбъект.ДополнительныеСвойства.ТаблицаКолонок.Найти(СтрокаПараметров.Параметр4, "Колонка");
	
	МассивДатС = ПериодыДляРазмещения.ВыгрузитьКолонку("ДатаС");
	МассивДатПо = ПериодыДляРазмещения.ВыгрузитьКолонку("ДатаПо");
	
	ПоискДат = Новый СписокЗначений;
	ПоискДат.ЗагрузитьЗначения(МассивДатС);
	ПоискДат.СортироватьПоЗначению();
	
	МинимальнаяДата = ПоискДат[0];
	
	ПоискДат.ЗагрузитьЗначения(МассивДатПо);
	ПоискДат.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
	
	МаксимальнаяДата = ПоискДат[0];
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаДату", Новый Граница(ДокументОбъект.Дата, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("РазрезДанных", СтрокаПараметров.Параметр5);
	Запрос.УстановитьПараметр("Работник", СтрокаРаботник.Значение);
	Запрос.УстановитьПараметр("ДатаС", МинимальнаяДата.Значение);
	Запрос.УстановитьПараметр("ДатаПо", МаксимальнаяДата.Значение);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ГрафикиРаботниковОстатки.Измерение2 КАК ДатаС,
	|	ГрафикиРаботниковОстатки.Измерение3 КАК ДатаПо,
	|	ГрафикиРаботниковОстатки.Измерение4 КАК ГрафикРаботы,
	|	ГрафикиРаботниковОстатки.Измерение2 > &ДатаС
	|		И ГрафикиРаботниковОстатки.Измерение3 < &ДатаПо КАК Внутри
	|ПОМЕСТИТЬ ВТ_Периоды
	|ИЗ
	|	РегистрНакопления.УниверсальныйРН_ОС.Остатки(
	|			&НаДату,
	|			РазрезДанных = &РазрезДанных
	|				И Измерение1 = &Работник
	|				И (ВЫРАЗИТЬ(Измерение2 КАК ДАТА)) < &ДатаПо
	|				И (ВЫРАЗИТЬ(Измерение3 КАК ДАТА)) >= &ДатаС) КАК ГрафикиРаботниковОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Периоды.ДатаС КАК ДатаС,
	|	ВТ_Периоды.ДатаПо КАК ДатаПо,
	|	ВТ_Периоды.ГрафикРаботы КАК ГрафикРаботы
	|ИЗ
	|	ВТ_Периоды КАК ВТ_Периоды
	|ГДЕ
	|	НЕ ВТ_Периоды.Внутри
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Периоды.ДатаС КАК ДатаС,
	|	ВТ_Периоды.ДатаПо КАК ДатаПо,
	|	ВТ_Периоды.ГрафикРаботы КАК ГрафикРаботы
	|ИЗ
	|	ВТ_Периоды КАК ВТ_Периоды
	|ГДЕ
	|	ВТ_Периоды.Внутри";
	Результат = Запрос.ВыполнитьПакет();
	
	ПограничныеПериоды = Результат[1].Выгрузить();
	ВнутренниеПериоды = Результат[2].Выгрузить();
	
	Для Каждого СтрокаПограничныйПериод Из ПограничныеПериоды Цикл
		Если СтрокаПограничныйПериод.ДатаС <= МинимальнаяДата.Значение Тогда
			ДатаС = СтрокаПограничныйПериод.ДатаС;
			ДатаПо = МинимальнаяДата.Значение - ?(МинимальнаяДата.Значение = НачалоДня(МинимальнаяДата.Значение), 1, 0);
			
			Если ДатаС < ДатаПо Тогда
				НоваяСтрокаТаблицаНовыхДвижений = ТаблицаНовыхДвижений.Добавить();
				НоваяСтрокаТаблицаНовыхДвижений.ВидДвижения = Истина; // Приход
				НоваяСтрокаТаблицаНовыхДвижений.ДатаС = СтрокаПограничныйПериод.ДатаС;
				НоваяСтрокаТаблицаНовыхДвижений.ДатаПо = МинимальнаяДата.Значение - ?(МинимальнаяДата.Значение = НачалоДня(МинимальнаяДата.Значение), 1, 0);
				НоваяСтрокаТаблицаНовыхДвижений.ГрафикРаботы = СтрокаПограничныйПериод.ГрафикРаботы;
				НоваяСтрокаТаблицаНовыхДвижений.Баланс_ = 1;
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаПограничныйПериод.ДатаПо >= МаксимальнаяДата.Значение Тогда
			ДатаС = МаксимальнаяДата.Значение + ?(МаксимальнаяДата.Значение = НачалоДня(МаксимальнаяДата.Значение), 0, 1);
			ДатаПо = СтрокаПограничныйПериод.ДатаПо;
			
			Если ДатаС < ДатаПо Тогда
				НоваяСтрокаТаблицаНовыхДвижений = ТаблицаНовыхДвижений.Добавить();
				НоваяСтрокаТаблицаНовыхДвижений.ВидДвижения = Истина; // Приход
				НоваяСтрокаТаблицаНовыхДвижений.ДатаС = ДатаС;
				НоваяСтрокаТаблицаНовыхДвижений.ДатаПо = ДатаПо;
				НоваяСтрокаТаблицаНовыхДвижений.ГрафикРаботы = СтрокаПограничныйПериод.ГрафикРаботы;
				НоваяСтрокаТаблицаНовыхДвижений.Баланс_ = 1;
			КонецЕсли;
		КонецЕсли;
		
		НоваяСтрокаТаблицаНовыхДвижений = ТаблицаНовыхДвижений.Добавить();
		НоваяСтрокаТаблицаНовыхДвижений.ВидДвижения = Ложь; // Расход
		НоваяСтрокаТаблицаНовыхДвижений.ДатаС = СтрокаПограничныйПериод.ДатаС;
		НоваяСтрокаТаблицаНовыхДвижений.ДатаПо = СтрокаПограничныйПериод.ДатаПо;
		НоваяСтрокаТаблицаНовыхДвижений.ГрафикРаботы = СтрокаПограничныйПериод.ГрафикРаботы;
		НоваяСтрокаТаблицаНовыхДвижений.Баланс_ = 1;
	КонецЦикла;
	
	Для Каждого СтрокаПериодыДляРазмещения Из ПериодыДляРазмещения Цикл
		НоваяСтрокаТаблицаНовыхДвижений = ТаблицаНовыхДвижений.Добавить();
		НоваяСтрокаТаблицаНовыхДвижений.ВидДвижения = ?(СтрокаПериодыДляРазмещения.Исключить_, Ложь, Истина);
		НоваяСтрокаТаблицаНовыхДвижений.ДатаС = СтрокаПериодыДляРазмещения.ДатаС;
		НоваяСтрокаТаблицаНовыхДвижений.ДатаПо = СтрокаПериодыДляРазмещения.ДатаПо;
		НоваяСтрокаТаблицаНовыхДвижений.ГрафикРаботы = СтрокаПериодыДляРазмещения.ГрафикРаботы;
		НоваяСтрокаТаблицаНовыхДвижений.Баланс_ = 1;
	КонецЦикла;
	
	Для Каждого СтрокаВнутренниеПериоды Из ВнутренниеПериоды Цикл
		НоваяСтрокаТаблицаНовыхДвижений = ТаблицаНовыхДвижений.Добавить();
		НоваяСтрокаТаблицаНовыхДвижений.ВидДвижения = Ложь; // Расход
		НоваяСтрокаТаблицаНовыхДвижений.ДатаС = СтрокаВнутренниеПериоды.ДатаС;
		НоваяСтрокаТаблицаНовыхДвижений.ДатаПо = СтрокаВнутренниеПериоды.ДатаПо;
		НоваяСтрокаТаблицаНовыхДвижений.ГрафикРаботы = СтрокаВнутренниеПериоды.ГрафикРаботы;
		НоваяСтрокаТаблицаНовыхДвижений.Баланс_ = 1;
	КонецЦикла;
	
	ТаблицаНовыхДвижений.Сортировать("ГрафикРаботы, ДатаС");
	
	ПредыдущаяСтрока = Неопределено;
	
	Для Каждого СтрокаТаблицаНовыхДвижений Из ТаблицаНовыхДвижений Цикл
		Если СтрокаТаблицаНовыхДвижений.ВидДвижения = Ложь Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПредыдущаяСтрока = Неопределено
			Или ПредыдущаяСтрока.ГрафикРаботы <> СтрокаТаблицаНовыхДвижений.ГрафикРаботы Тогда
			ПредыдущаяСтрока = СтрокаТаблицаНовыхДвижений;
			
			Продолжить;
		КонецЕсли;
		
		Если ПредыдущаяСтрока.ДатаПо + 1 >= СтрокаТаблицаНовыхДвижений.ДатаС Тогда
			ПредыдущаяСтрока.ДатаПо = СтрокаТаблицаНовыхДвижений.ДатаПо;
			
			СтрокаТаблицаНовыхДвижений.ДатаС = Неопределено;
			
			Продолжить;
		КонецЕсли;
		
		ПредыдущаяСтрока = СтрокаТаблицаНовыхДвижений;
	КонецЦикла;
	
	СтрокиДляУдаления = ТаблицаНовыхДвижений.НайтиСтроки(Новый Структура("ДатаС", Дата("00010101")));
	
	Для Каждого СтрокаДляУдаления Из СтрокиДляУдаления Цикл
		ТаблицаНовыхДвижений.Удалить(СтрокаДляУдаления);
	КонецЦикла;
	
	ТаблицаНовыхДвижений.Свернуть("ВидДвижения, ДатаПо, ДатаС, ГрафикРаботы, Баланс_");
КонецПроцедуры
